Repository: gooseprjkt/FlipperDuckyMaker
Catalog: lib/l10n/app_*.arb
Languages: ru

source: USB ID Changer
ru: Изменение ID USB

# systemRequest
source: System Request (SYSRQ)
ru: Системный запрос (SYSRQ)

# altNumpadString
source: Alt+Numpad String (ALTCODE)
ru: Строка с Alt+цифры (ALTCODE)

# stringWithNewline
source: String with Newline (STRINGLN)
ru: Строка с новой строкой (STRINGLN)

# holdReleaseKey
source: Hold/Release Key (HOLD/RELEASE)
ru: Удержание/Отпускание клавиши (HOLD/RELEASE)

# changeId
source: Change ID (VID/PID)
ru: Изменить ID (VID/PID)

source: Vendor ID
ru: ID производителя

source: Product ID
ru: ID продукта

source: VENDOR:PRODUCT
ru: ПРОИЗВОДИТЕЛЬ:ПРОДУКТ

source: Vendor
ru: Производитель

source: Product
ru: Продукт

# remark
source: Remark (REM)
ru: Комментарий (REM)

# string
source: String (STRING)
ru: Строка (STRING)

source: Delays
ru: Задержки

source: Misc. Commands
ru: Прочие команды

source: Modifier Keys
ru: Клавиши-модификаторы

source: Combo Keys
ru: Комбинации клавиш

# arrowKeys
source: Arrow Keys / Cursor
ru: Клавиши стрелок / Курсор

source: Main Control Keys
ru: Основные управляющие клавиши

source: Others Control Keys
ru: Другие управляющие клавиши

source: Function Keys
ru: Функциональные клавиши

source: Output
ru: Вывод

# outputDescription
source: Your badUSB payload will be here. At the end of the process, click "Save", and the download will automatically start. You can also edit manually the script before download.
ru: Ваш пейлоад badUSB будет здесь. В конце процесса нажмите "Сохранить", и загрузка начнется автоматически. Вы также можете вручно отредактировать скрипт перед загрузкой.

source: Save As...
ru: Сохранить как...

# payloadPlaceholder
source: Here your Payload...
ru: Здесь ваш пейлоад...

# payloadSaved
source: Payload saved successfully!
ru: Пейлоад успешно сохранен!

source: Copy
ru: Копировать

source: Write Remark
ru: Написать комментарий

source: Write String
ru: Написать строку

source: Write Altcode
ru: Написать Alt-код

source: Write StringLN
ru: Написать StringLN

source: DELAY
ru: ЗАДЕРЖКА

source: DEFAULT DELAY
ru: СТАНДАРТНАЯ ЗАДЕРЖКА

source: BUTTON_PRESS
ru: НАЖАТИЕ КНОПКИ

source: REPEAT
ru: ПОВТОР

source: ALTCHAR
ru: ALTСИМВОЛ

# codePlaceholder
source: Code
ru: Код

# sysrq
source: SysRq (Linux ONLY)
ru: SysRq (только для Linux)

source: HOLD/RELEASE
ru: УДЕРЖАНИЕ/ОТПУСКАНИЕ

source: PRINT SCREEN
ru: ПЕЧАТЬ ЭКРАНА

source: PAGE UP
ru: СТР.ВВЕРХ

source: PAGE DOWN
ru: СТР.ВНИЗ

source: SPACE
ru: ПРОБЕЛ

# upArrow
source: UP
ru: ВВЕРХ

# leftArrow
source: LEFT
ru: ВЛЕВО

# downArrow
source: DOWN
ru: ВНИЗ

# rightArrow
source: RIGHT
ru: ВПРАВО

source: Type your text here.
ru: Введите текст здесь.

# usbIdChangerDescription
source: VendorID an ProductID are codes used to identify your keyboard. ONLY if you are targeting a macOS, remember to insert the ID command, to change VID / PID, at the top of your code.
ru: VendorID и ProductID - это коды, используемые для идентификации вашей клавиатуры. ТОЛЬКО если вы нацелены на macOS, не забудьте вставить команду ID, чтобы изменить VID / PID, в начало вашего кода.

# remarkDescription
source: REM is short for Remark and adds a comment to the payload, like a title, the target OS, the functioning of a command or the author's name.
ru: REM - это сокращение от Remark, и добавляет комментарий к полезному грузу, например, название, целевую ОС, работу команды или имя автора.

# stringDescription
source: STRING injects keystrokes, or "types", the given characters (a-z, 0-9, punctuation & specials).
ru: STRING вводит нажатия клавиш или "вводит" заданные символы (a-z, 0-9, знаки препинания и специальные символы).

# delaysDescription
source: DELAY is expressed in milliseconds (1 sec. = 1000 ms.). The minimum is 100 (0.1 sec.). It increases/decreases by 100 milliseconds each click. DEFAULT_DELAY / DEFAULTDELAY add delay before every next command.
ru: DELAY выражается в миллисекундах (1 сек. = 1000 мс.). Минимум 100 (0,1 сек.). Увеличивается/уменьшается на 100 миллисекунд при каждом нажатии. DEFAULT_DELAY / DEFAULTDELAY добавляют задержку перед каждой следующей командой.

# miscCommandsDescription
source: REPEAT is used to repeat the previous command. It expects the number of additional repeats as parameter. ALTCHAR is to display single ALT+Numpad Keys (on Windows), or ALT(ALT+SHIFT) Keys (on macOS).
ru: REPEAT используется для повторения предыдущей команды. Ожидает количество дополнительных повторов в качестве параметра. ALTCHAR используется для отображения одиночных клавиш Alt+цифры (в Windows) или клавиш ALT(ALT+SHIFT) (в macOS).

# modifierKeysDescription
source: GUI is used for both: the WINDOWS(⊔) key on Windows, and the CMD(⌘) key on macOS. (Targeting Windows, you can use WINDOWS key or GUI key to get the same result). CONTROL and CTRL as well. If you need to use more than one "modifier key" at once, use the preloaded "Keys Combos", which you'll find just below these Modifier keys.
ru: GUI используется как для клавиши WINDOWS(⊔) в Windows, так и для клавиши CMD(⌘) в macOS. (При работе с Windows вы можете использовать клавишу WINDOWS или GUI для получения того же результата). CONTROL и CTRL тоже. Если вам нужно использовать более одной "клавиши-модификатора" одновременно, используйте предустановленные "Комбинации клавиш", которые вы найдете прямо под этими клавишами-модификаторами.

# comboKeysDescription
source: ONLY on Windows: CTRL-ALT is the same as to type ALTgr (ALT Graphic) and you can use both ALT-WINDOWS or ALT-GUI, and WINDOWS-SHIFT or GUI-SHIFT to get the exact same result.
ru: ТОЛЬКО в Windows: CTRL-ALT эквивалентно вводу ALTgr (ALT Graphic), и вы можете использовать как ALT-WINDOWS, так и ALT-GUI, а также WINDOWS-SHIFT или GUI-SHIFT для получения точно такого же результата.

# arrowKeysDescription
source: UP is the same as UPARROW. DOWN is the same ad DOWNARROW. LEFT is the same as LEFTARROW. RIGHT is the same as RIGHTARROW.
ru: UP эквивалентно UPARROW. DOWN эквивалентно DOWNARROW. LEFT эквивалентно LEFTARROW. RIGHT эквивалентно RIGHTARROW.

# othersControlKeysDescription
source: The magic SysRq key is a key combination understood by the Linux kernel, which allows the user to perform various low-level commands regardless of the system's state. It is often used to recover from freezes, or to reboot a computer without corrupting the filesystem.
ru: Магическая клавиша SysRq - это комбинация клавиш, понятная ядру Linux, которая позволяет пользователю выполнять различные низкоуровневые команды независимо от состояния системы. Часто используется для восстановления после зависаний или для перезагрузки компьютера без повреждения файловой системы.

# sysrqPlaceholder
source: SysRq command
ru: Команда SysRq

# holdReleasePlaceholder
source: Key to hold/release
ru: Клавиша для удержания/отпускания

# settingsTitle
source: Settings
ru: Настройки

source: Open Source Licenses
ru: Лицензии открытого ПО

source: Close
ru: Закрыть

source: File Name
ru: Имя файла

# fileNamePlaceholder
source: Enter filename
ru: Введите имя файла

source: File Type
ru: Тип файла

source: Use custom directory
ru: Использовать другую директорию

source: Directory path
ru: Путь к директории

source: Preview
ru: Предпросмотр

source: Save
ru: Сохранить

source: Error
ru: Ошибка

source: No content to save
ru: Нет содержимого для сохранения

source: File saved successfully
ru: Файл успешно сохранен

source: Download folder
ru: Папка загрузок
